Revit 2027 API
RadioButtonGroup.GetItems Method
Gets the collection of ToggleButtons assigned to the RadioButtonGroup.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ToggleButton> GetItems()
Public Function GetItems As IList(Of ToggleButton)
public:
IList<ToggleButton^>^ GetItems()
member GetItems : unit -> IList<ToggleButton>
Return Value
IList<ToggleButton>
Remarks
This is a copy of all the ToggleButtons assigned to this group.
See Also
Reference
RadioButtonGroup Class
Autodesk.Revit.UI Namespace